import json

# JSON-объект с данными
data = {
    'Договара': [
        {
            "Номер договора": "11",
            "ФИО": "Иванов Иван Иванович",
            "Отдел": "Администрация",
            "Выплаты": [
                {"Год": "2010", "Месяц": "1", "Размер выплаты": "150000"},
                {"Год": "2010", "Месяц": "2", "Размер выплаты": "130000"}
            ]
        },
        {
            "Номер договора": "12",
            "ФИО": "Петров Петр Петрович",
            "Отдел": "Отдел продаж",
            "Выплаты": [
                {"Год": "2010", "Месяц": "1", "Размер выплаты": "140000"},
                {"Год": "2010", "Месяц": "2", "Размер выплаты": "120000"}
            ]
        },
        {
            "Номер договора": "13",
            "ФИО": "Сидорова Мария Александровна",
            "Отдел": "Отдел разработки",
            "Выплаты": [
                {"Год": "2010", "Месяц": "1", "Размер выплаты": "160000"},
                {"Год": "2010", "Месяц": "2", "Размер выплаты": "125000"}
            ]
        }
    ]
}

# Запись данных в JSON-файл
with open('3.json', 'w') as file:
    json.dump(data, file, indent=4)

print("JSON-файл успешно создан.")